In [54]:
import pandas as pd

# 1. Series (1D)

In [55]:
series=pd.Series([1,2,23,4],index=["a",'b','c','d'])
series2=pd.Series([1,2,3,4])

In [56]:
series.

SyntaxError: invalid syntax (2435730899.py, line 1)

In [ ]:
series2

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
print(series['a'])

1

# 2. DataFrame (2D)

In [ ]:
dataframe=pd.DataFrame({
    "name":["anil","sunil","reshma"],
    "marks":[91,67,100]
})

In [ ]:
dict={
    "name":["anil","sunil","reshma"],
    "marks":[91,67,100]
}

dataframe_1=pd.DataFrame(dict)

In [ ]:
data_frame_3=[["anil",91],["sunil",100]]
dataframe_3=pd.DataFrame(data_frame_3,columns=["name","marks"])

In [ ]:
dataframe

     name  marks
0    anil     91
1   sunil     67
2  reshma    100

In [ ]:
dataframe_1

     name  marks
0    anil     91
1   sunil     67
2  reshma    100

In [ ]:
dataframe_3

    name  marks
0   anil     91
1  sunil    100